import { motion } from "framer-motion";
import TopLogo from "../Header/TopLogo";
import MenuDesk from "../Header/MenuDesk";
import { Link } from "react-router-dom";

const Landing = () => {
  return (
    <motion.div
      initial={{ opacity: 0 }}
      animate={{ opacity: 1 }}
      exit={{ opacity: 0 }}
      transition={{ duration: 1 }}
    >
      <div className="w h  flex justify-start items-center flex-col bg-zinc-100">
        <TopLogo />
        <MenuDesk bgColor="bg-[#024B74]" />
        <div className="w-[85%] flex">
          <div className="h-[800px] w-[40%] rounded-b-full   bg-[url('/public/image/rectangle.png')]  bg-center bg-cover"></div>
          <div className="w-[70%] gap-5 pt-8 flex flex-col justify-start items-center relative">
            <h1 className="text-[6vw] w text-center font-bold">
              دریافت ویزای برزیل
            </h1>
            <span className="text-[30px] text-right pr-7 font-semibold text-zinc-500 w">
              شرایط، مدارک و هزینه های ویزای کاری برزیل
            </span>
            <p className="w text-wrap leading-8 pr-7  text-justify">
              برج جذاب ترکیه یکی از بزرگترین و زیباترین برج های ترکیه واقع در
              استانبول می باشد که شما می توانید با خرید یک بلیط چارتری مشاهده
              نمایید برج جذاب ترکیه یکی از بزرگترین و زیباترین برج های ترکیه
              واقع در استانبول می باشد که شما می توانید با خرید یک بلیط چارتری
              مشاهده نمایید برج جذاب ترکیه یکی از بزرگترین و زیباترین برج های
              ترکیه واقع در استانبول می باشد که شما می توانید با خرید یک بلیط
              چارتری مشاهده نمایید برج جذاب ترکیه یکی از بزرگترین و زیباترین برج
              های ترکیه واقع در استانبول می باشد که شما می توانید با خرید یک
              بلیط چارتری مشاهده نمایید برج جذاب ترکیه یکی از بزرگترین و
              زیباترین برج های ترکیه واقع در استانبول می باشد که شما می توانید
              با خرید یک بلیط چارتری مشاهده نمایید برج جذاب ترکیه یکی از
              بزرگترین و زیباترین برج های ترکیه واقع در استانبول می باشد که شما
              می توانید با خرید یک بلیط چارتری مشاهده نمایید برج جذاب ترکیه یکی
              از بزرگترین و زیباترین برج های ترکیه واقع در استانبول می باشد که
              شما می توانید با خرید یک بلیط چارتری مشاهده نمایید برج جذاب ترکیه
              یکی از بزرگترین و زیباترین برج های ترکیه واقع در استانبول می باشد
              که شما می توانید با خرید یک بلیط چارتری مشاهده نمایید
            </p>
            <div className="w h flex justify-end p-[20px] items-start">
              <button className="bg-[#4391B7] text-white text-[20px] hover:shadow-lg hover:scale-[1.01] transition-all duration-300 hover:bg-[#2486b7] hover:shadow-black/30  w-1/2 h-[70px] rounded-xl">
                تماس با کارشناسان
              </button>
            </div>
            <div className="absolute -bottom-[300px] gap-[20px] flex flex-col justify-start p-[30px] items-start -right-40 w-3/5 h-3/5 rounded-3xl bg-white shadow-2xl shadow-black/20">
              <div className="w h-[50%] rounded-3xl overflow-hidden f">
                <img
                  src="/public/image/why-us-1.jpg"
                  className="object-cover "
                  alt=""
                />
              </div>
              <h1 className="text-[25px] font-semibold">جاذبه های برزیل</h1>
              <p className=" text-wrap text-justify w-[80%]">
                برج جذاب ترکیه یکی از بزرگترین و زیباترین برج های ترکیه واقع در
                استانبول می باشد که شما می توانید با خرید یک بلیط چارتری مشاهده
                نمایید
              </p>

              <div className="flex justify-between relative items-center w-[40%]  mt-[15px] ">
                <div className="w-[45px] h-[45px] rounded-full bg-zinc-200  f">
                  <svg
                    xmlns="http://www.w3.org/2000/svg"
                    viewBox="0 0 24 24"
                    className="w-[25px] rounded-full  fill-orange-500"
                  >
                    <path d="m12 0c-6.627 0-12 5.373-12 12s5.373 12 12 12 12-5.373 12-12c0-6.627-5.373-12-12-12zm5.894 8.221-1.97 9.28c-.145.658-.537.818-1.084.508l-3-2.21-1.446 1.394c-.14.18-.357.295-.6.295-.002 0-.003 0-.005 0l.213-3.054 5.56-5.022c.24-.213-.054-.334-.373-.121l-6.869 4.326-2.96-.924c-.64-.203-.658-.64.135-.954l11.566-4.458c.538-.196 1.006.128.832.941z" />
                  </svg>
                </div>
                <div className="w-[45px] h-[45px] rounded-full bg-zinc-200  f">
                  <svg
                    className="w-[25px]  fill-orange-500"
                    viewBox="0 0 24 24"
                    xmlns="http://www.w3.org/2000/svg"
                  >
                    <path
                      fill-rule="evenodd"
                      clip-rule="evenodd"
                      d="M12 18C15.3137 18 18 15.3137 18 12C18 8.68629 15.3137 6 12 6C8.68629 6 6 8.68629 6 12C6 15.3137 8.68629 18 12 18ZM12 16C14.2091 16 16 14.2091 16 12C16 9.79086 14.2091 8 12 8C9.79086 8 8 9.79086 8 12C8 14.2091 9.79086 16 12 16Z"
                    />
                    <path d="M18 5C17.4477 5 17 5.44772 17 6C17 6.55228 17.4477 7 18 7C18.5523 7 19 6.55228 19 6C19 5.44772 18.5523 5 18 5Z" />
                    <path
                      fill-rule="evenodd"
                      clip-rule="evenodd"
                      d="M1.65396 4.27606C1 5.55953 1 7.23969 1 10.6V13.4C1 16.7603 1 18.4405 1.65396 19.7239C2.2292 20.8529 3.14708 21.7708 4.27606 22.346C5.55953 23 7.23969 23 10.6 23H13.4C16.7603 23 18.4405 23 19.7239 22.346C20.8529 21.7708 21.7708 20.8529 22.346 19.7239C23 18.4405 23 16.7603 23 13.4V10.6C23 7.23969 23 5.55953 22.346 4.27606C21.7708 3.14708 20.8529 2.2292 19.7239 1.65396C18.4405 1 16.7603 1 13.4 1H10.6C7.23969 1 5.55953 1 4.27606 1.65396C3.14708 2.2292 2.2292 3.14708 1.65396 4.27606ZM13.4 3H10.6C8.88684 3 7.72225 3.00156 6.82208 3.0751C5.94524 3.14674 5.49684 3.27659 5.18404 3.43597C4.43139 3.81947 3.81947 4.43139 3.43597 5.18404C3.27659 5.49684 3.14674 5.94524 3.0751 6.82208C3.00156 7.72225 3 8.88684 3 10.6V13.4C3 15.1132 3.00156 16.2777 3.0751 17.1779C3.14674 18.0548 3.27659 18.5032 3.43597 18.816C3.81947 19.5686 4.43139 20.1805 5.18404 20.564C5.49684 20.7234 5.94524 20.8533 6.82208 20.9249C7.72225 20.9984 8.88684 21 10.6 21H13.4C15.1132 21 16.2777 20.9984 17.1779 20.9249C18.0548 20.8533 18.5032 20.7234 18.816 20.564C19.5686 20.1805 20.1805 19.5686 20.564 18.816C20.7234 18.5032 20.8533 18.0548 20.9249 17.1779C20.9984 16.2777 21 15.1132 21 13.4V10.6C21 8.88684 20.9984 7.72225 20.9249 6.82208C20.8533 5.94524 20.7234 5.49684 20.564 5.18404C20.1805 4.43139 19.5686 3.81947 18.816 3.43597C18.5032 3.27659 18.0548 3.14674 17.1779 3.0751C16.2777 3.00156 15.1132 3 13.4 3Z"
                    />
                  </svg>
                </div>
                <div className="w-[45px] h-[45px] rounded-full bg-zinc-200  f">
                  <svg
                    version="1.1"
                    id="Layer_1"
                    xmlns="http://www.w3.org/2000/svg"
                    xmlns:xlink="http://www.w3.org/1999/xlink"
                    viewBox="0 0 308 308"
                    xml:space="preserve"
                    className="w-[25px]  fill-orange-500"
                  >
                    <g id="XMLID_468_">
                      <path
                        id="XMLID_469_"
                        d="M227.904,176.981c-0.6-0.288-23.054-11.345-27.044-12.781c-1.629-0.585-3.374-1.156-5.23-1.156
		c-3.032,0-5.579,1.511-7.563,4.479c-2.243,3.334-9.033,11.271-11.131,13.642c-0.274,0.313-0.648,0.687-0.872,0.687
		c-0.201,0-3.676-1.431-4.728-1.888c-24.087-10.463-42.37-35.624-44.877-39.867c-0.358-0.61-0.373-0.887-0.376-0.887
		c0.088-0.323,0.898-1.135,1.316-1.554c1.223-1.21,2.548-2.805,3.83-4.348c0.607-0.731,1.215-1.463,1.812-2.153
		c1.86-2.164,2.688-3.844,3.648-5.79l0.503-1.011c2.344-4.657,0.342-8.587-0.305-9.856c-0.531-1.062-10.012-23.944-11.02-26.348
		c-2.424-5.801-5.627-8.502-10.078-8.502c-0.413,0,0,0-1.732,0.073c-2.109,0.089-13.594,1.601-18.672,4.802
		c-5.385,3.395-14.495,14.217-14.495,33.249c0,17.129,10.87,33.302,15.537,39.453c0.116,0.155,0.329,0.47,0.638,0.922
		c17.873,26.102,40.154,45.446,62.741,54.469c21.745,8.686,32.042,9.69,37.896,9.69c0.001,0,0.001,0,0.001,0
		c2.46,0,4.429-0.193,6.166-0.364l1.102-0.105c7.512-0.666,24.02-9.22,27.775-19.655c2.958-8.219,3.738-17.199,1.77-20.458
		C233.168,179.508,230.845,178.393,227.904,176.981z"
                      />
                      <path
                        id="XMLID_470_"
                        d="M156.734,0C73.318,0,5.454,67.354,5.454,150.143c0,26.777,7.166,52.988,20.741,75.928L0.212,302.716
		c-0.484,1.429-0.124,3.009,0.933,4.085C1.908,307.58,2.943,308,4,308c0.405,0,0.813-0.061,1.211-0.188l79.92-25.396
		c21.87,11.685,46.588,17.853,71.604,17.853C240.143,300.27,308,232.923,308,150.143C308,67.354,240.143,0,156.734,0z
		 M156.734,268.994c-23.539,0-46.338-6.797-65.936-19.657c-0.659-0.433-1.424-0.655-2.194-0.655c-0.407,0-0.815,0.062-1.212,0.188
		l-40.035,12.726l12.924-38.129c0.418-1.234,0.209-2.595-0.561-3.647c-14.924-20.392-22.813-44.485-22.813-69.677
		c0-65.543,53.754-118.867,119.826-118.867c66.064,0,119.812,53.324,119.812,118.867
		C276.546,215.678,222.799,268.994,156.734,268.994z"
                      />
                    </g>
                  </svg>
                </div>
              </div>
              <Link
                className="h-[90px]   w-[90px] absolute  rounded-full stroke-5 flex justify-center items-center bottom-[-10px] left-[-10px]  bg-white"
                to="/blog"
              >
                <div className="h-[55px] w-[55px] f hover:scale-[1.1] z-[10] transition-all duration-200 bg-[#BCD6E3] rounded-full cursor-pointer">
                  <img
                    src="/public/image/arrow-blog.png"
                    className="rotate-[135deg] w-[30px]"
                    alt=""
                  />
                </div>
              </Link>
            </div>
          </div>
        </div>
        <div className="w h-[900px] pt-[400px] flex justify-between  flex-col items-center bg-zinc-100">
          <img
            src="/public/image/dots.png"
            alt=""
            className="absolute right-16"
          />
          <h1 className="text-[50px] font-bold">ویژگی های تور های برزیل</h1>
          <div className="w-[90%] flex items-center justify-between mt-[50px] relative ">
            <div className="w-[300px] bg-zinc-100 relative h-[350px] rounded-3xl group hover:shadow-2xl z-10 hover:scale-[1.02] cursor-default transition-all duration-300 hover:shadow-black/40 flex flex-col justify-between p-[30px] items-center ">
              <img
                src="/public/image/Category.png"
                alt=""
                className="w-[70%] mt-[-15px]"
              />
              <h1 className="text-[25px]">کشور ماجراجویی</h1>
              <p className="text-wrap text-[15px] text-center">
                برج جذاب ترکیه یکی از بزرگترین و زیباترین برج های ترکیه واقع در
                استانبول می باشد که شما می توانید با خرید یک بلیط چارتری مشاهده
                نمایید
              </p>
              <div className="absolute bg-[#4190B7] w-[120px] h-[120px] -z-10 rounded-br-[20px] opacity-0 bottom-[-35px] left-[-35px] group-hover:opacity-100 rounded-tr-[100px] rounded-tl-[40px] transition-all duration-200">
                <div className="w-[85px] h-[85px] bg-zinc-100 rounded-bl-3xl me-5  "></div>
              </div>
            </div>

            <div
              className="w-[300px] h-[350px] rounded-3xl  bg-zinc-100
             hover:shadow-2xl group hover:scale-[1.02] cursor-default relative z-10 transition-all duration-300 hover:shadow-black/40 flex flex-col justify-between p-[30px] items-center"
            >
              <img
                src="/public/image/Category2.png"
                alt=""
                className="w-[60%]"
              />
              <h1 className="text-[25px]">پرواز مستقیم</h1>
              <p className="text-wrap text-[15px] text-center">
                برج جذاب ترکیه یکی از بزرگترین و زیباترین برج های ترکیه واقع در
                استانبول می باشد که شما می توانید با خرید یک بلیط چارتری مشاهده
                نمایید
              </p>
              <div className="absolute bg-[#4190B7] w-[120px] h-[120px] -z-10 rounded-br-[20px] opacity-0 bottom-[-35px] left-[-35px] group-hover:opacity-100 rounded-tr-[100px] rounded-tl-[40px] transition-all duration-200">
                <div className="w-[85px] h-[85px] bg-zinc-100 rounded-bl-3xl me-5  "></div>
              </div>
            </div>
            <div
              className="w-[300px] h-[350px] rounded-3xl  bg-zinc-100
             hover:shadow-2xl group hover:scale-[1.02] cursor-default relative z-10 transition-all duration-300 hover:shadow-black/40 flex flex-col justify-between p-[30px] items-center"
            >
              <img
                src="/public/image/Category.png"
                alt=""
                className="w-[70%]"
              />
              <h1 className="text-[25px]">کیفیت پرواز</h1>
              <p className="text-wrap text-[15px] text-center">
                برج جذاب ترکیه یکی از بزرگترین و زیباترین برج های ترکیه واقع در
                استانبول می باشد که شما می توانید با خرید یک بلیط چارتری مشاهده
                نمایید
              </p>
              <div className="absolute bg-[#4190B7] w-[120px] h-[120px] -z-10 rounded-br-[20px] opacity-0 bottom-[-35px] left-[-35px] group-hover:opacity-100 rounded-tr-[100px] rounded-tl-[40px] transition-all duration-200">
                <div className="w-[85px] h-[85px] bg-zinc-100 rounded-bl-3xl me-5  "></div>
              </div>
            </div>
            <div
              className="w-[300px] h-[350px] rounded-3xl  bg-zinc-100
             hover:shadow-2xl group hover:scale-[1.02] cursor-default relative z-10 transition-all duration-300 hover:shadow-black/40 flex flex-col justify-between p-[30px] items-center"
            >
              <img
                src="/public/image/Category.png"
                alt=""
                className="w-[70%]"
              />
              <h1 className="text-[25px]">کشور ماجراجویی</h1>
              <p className="text-wrap text-[15px] text-center">
                برج جذاب ترکیه یکی از بزرگترین و زیباترین برج های ترکیه واقع در
                استانبول می باشد که شما می توانید با خرید یک بلیط چارتری مشاهده
                نمایید
              </p>
              <div className="absolute bg-[#4190B7] w-[120px] h-[120px] -z-10 rounded-br-[20px] opacity-0 bottom-[-35px] left-[-35px] group-hover:opacity-100 rounded-tr-[100px] rounded-tl-[40px] transition-all duration-200">
                <div className="w-[85px] h-[85px] bg-zinc-100 rounded-bl-3xl me-5  "></div>
              </div>
            </div>
          </div>
        </div>
        <div className="relative w h-[1000px] pt-[300px] flex justify-between flex-col items-center  bg-zinc-100 ">
          <img src="/public/image/world_map.png" className="absolute " alt="" />
          <div className=" w flex items-center flex-col gap-[20px] z-10">
            <h1 className="text-[50px] font-bold">شرایط زندگی در برزیل</h1>
            <h2 className="text-[20px] text-wrap w-[35%] text-center">
              برج جذاب ترکیه یکی از بزرگترین و زیباترین برج های ترکیه واقع در
              استانبول می باشد که شما می توانید با خرید یک بلیط چارتری مشاهده
              نمایید
            </h2>
          </div>
          <div className="w-[85%] flex justify-between items-center z-10">
            <div className="w-[300px] h-[300px] border border-orange-500 rounded-2xl bg-zinc-100 flex flex-col justify-between p-[50px] items-center">
              <svg
                xmlns="http://www.w3.org/2000/svg"
                width="35"
                height="35"
                viewBox="0 0 35 35"
                fill="none"
              >
                <path
                  d="M3.09166 19.7253C4.17374 26.6975 10.2404 32.0773 17.5014 32.0773C25.5208 32.0773 32.0819 25.5163 32.0819 17.4969C32.0819 9.47755 25.5223 2.9165 17.5029 2.9165C12.6933 2.9165 8.46124 5.2513 5.83332 8.74984V2.91796L2.92103 2.9165L2.91666 13.1248H13.125V10.2082L8.45978 10.2067C10.5 7.58463 13.8571 5.83317 17.5029 5.83317C23.9167 5.83317 29.1667 11.0832 29.1667 17.4969C29.1667 23.9107 23.9167 29.1621 17.5014 29.1621C11.846 29.1621 7.10062 25.0875 6.05499 19.7253H3.09166Z"
                  fill="#365E7D"
                />
                <path
                  d="M16.0446 10.207V17.9391L20.7127 24.2056L23.046 22.4599L18.9613 17.0627V10.207H16.0446Z"
                  fill="#365E7D"
                />
              </svg>
              <h1 className="text-[30px] font-bold">2000+</h1>
              <span className="text-[20px]">تاریخچه فرهنگی</span>
            </div>
            <div className="w-[300px] h-[300px] border border-orange-500 rounded-2xl bg-zinc-100 flex flex-col justify-between p-[50px] items-center">
              <svg
                xmlns="http://www.w3.org/2000/svg"
                width="35"
                height="35"
                viewBox="0 0 35 35"
                fill="none"
              >
                <path
                  d="M3.09166 19.7253C4.17374 26.6975 10.2404 32.0773 17.5014 32.0773C25.5208 32.0773 32.0819 25.5163 32.0819 17.4969C32.0819 9.47755 25.5223 2.9165 17.5029 2.9165C12.6933 2.9165 8.46124 5.2513 5.83332 8.74984V2.91796L2.92103 2.9165L2.91666 13.1248H13.125V10.2082L8.45978 10.2067C10.5 7.58463 13.8571 5.83317 17.5029 5.83317C23.9167 5.83317 29.1667 11.0832 29.1667 17.4969C29.1667 23.9107 23.9167 29.1621 17.5014 29.1621C11.846 29.1621 7.10062 25.0875 6.05499 19.7253H3.09166Z"
                  fill="#365E7D"
                />
                <path
                  d="M16.0446 10.207V17.9391L20.7127 24.2056L23.046 22.4599L18.9613 17.0627V10.207H16.0446Z"
                  fill="#365E7D"
                />
              </svg>
              <h1 className="text-[30px] font-bold">2000+</h1>
              <span className="text-[20px]">تاریخچه فرهنگی</span>
            </div>
            <div className="w-[300px] h-[300px] border border-orange-500 rounded-2xl bg-zinc-100 flex flex-col justify-between p-[50px] items-center">
              <svg
                xmlns="http://www.w3.org/2000/svg"
                width="35"
                height="35"
                viewBox="0 0 35 35"
                fill="none"
              >
                <path
                  d="M3.09166 19.7253C4.17374 26.6975 10.2404 32.0773 17.5014 32.0773C25.5208 32.0773 32.0819 25.5163 32.0819 17.4969C32.0819 9.47755 25.5223 2.9165 17.5029 2.9165C12.6933 2.9165 8.46124 5.2513 5.83332 8.74984V2.91796L2.92103 2.9165L2.91666 13.1248H13.125V10.2082L8.45978 10.2067C10.5 7.58463 13.8571 5.83317 17.5029 5.83317C23.9167 5.83317 29.1667 11.0832 29.1667 17.4969C29.1667 23.9107 23.9167 29.1621 17.5014 29.1621C11.846 29.1621 7.10062 25.0875 6.05499 19.7253H3.09166Z"
                  fill="#365E7D"
                />
                <path
                  d="M16.0446 10.207V17.9391L20.7127 24.2056L23.046 22.4599L18.9613 17.0627V10.207H16.0446Z"
                  fill="#365E7D"
                />
              </svg>
              <h1 className="text-[30px] font-bold">2000+</h1>
              <span className="text-[20px]">تاریخچه فرهنگی</span>
            </div>
            <div className="w-[300px] h-[300px] border border-orange-500 rounded-2xl bg-zinc-100 flex flex-col justify-between p-[50px] items-center">
              <svg
                xmlns="http://www.w3.org/2000/svg"
                width="35"
                height="35"
                viewBox="0 0 35 35"
                fill="none"
              >
                <path
                  d="M3.09166 19.7253C4.17374 26.6975 10.2404 32.0773 17.5014 32.0773C25.5208 32.0773 32.0819 25.5163 32.0819 17.4969C32.0819 9.47755 25.5223 2.9165 17.5029 2.9165C12.6933 2.9165 8.46124 5.2513 5.83332 8.74984V2.91796L2.92103 2.9165L2.91666 13.1248H13.125V10.2082L8.45978 10.2067C10.5 7.58463 13.8571 5.83317 17.5029 5.83317C23.9167 5.83317 29.1667 11.0832 29.1667 17.4969C29.1667 23.9107 23.9167 29.1621 17.5014 29.1621C11.846 29.1621 7.10062 25.0875 6.05499 19.7253H3.09166Z"
                  fill="#365E7D"
                />
                <path
                  d="M16.0446 10.207V17.9391L20.7127 24.2056L23.046 22.4599L18.9613 17.0627V10.207H16.0446Z"
                  fill="#365E7D"
                />
              </svg>
              <h1 className="text-[30px] font-bold">2000+</h1>
              <span className="text-[20px]">تاریخچه فرهنگی</span>
            </div>
          </div>
        </div>
        <div className="mt-[100px]  flex justify-center items-start ">
          <div className="w-[30%] mt-[150px] h flex-col flex justify-start items-center ">
            <img src="/public/image/tiger.png" className="w" alt="" />
          </div>
          <div className="flex w-[70%] gap-[30px] p-[90px] h flex-col">
            <h1 className="text-[90px] font-bold">جنگل و حیوانات وحشی</h1>
            <div>
              <p className="text-wrap  text-[18px] leading-9">
                برج جذاب ترکیه یکی از بزرگترین و زیباترین برج های ترکیه واقع در
                استانبول می باشد که شما می توانید با خرید یک بلیط چارتری مشاهده
                نمایید برج جذاب ترکیه یکی از بزرگترین و زیباترین برج های ترکیه
                واقع در استانبول می باشد که شما می توانید با خرید یک بلیط چارتری
                مشاهده نمایید برج جذاب ترکیه یکی از بزرگترین و زیباترین برج های
                ترکیه واقع در استانبول می باشد که شما می توانید با خرید یک بلیط
                چارتری مشاهده نمایید برج جذاب ترکیه یکی از بزرگترین و زیباترین
                برج های ترکیه واقع در استانبول می باشد که شما می توانید با خرید
                یک بلیط چارتری مشاهده نمایید برج جذاب ترکیه یکی از بزرگترین و
                زیباترین برج های ترکیه واقع در استانبول می باشد که شما می توانید
                با خرید یک بلیط چارتری مشاهده نمایید برج جذاب ترکیه یکی از
                بزرگترین و زیباترین برج های ترکیه واقع در استانبول می باشد که
                شما می توانید با خرید یک بلیط چارتری مشاهده نمایید برج جذاب
                ترکیه یکی از بزرگترین و زیباترین برج های ترکیه واقع در استانبول
                می باشد که شما می توانید با خرید یک بلیط چارتری مشاهده نمایید
                برج جذاب ترکیه یکی از بزرگترین و زیباترین برج های ترکیه واقع در
                استانبول می باشد که شما می توانید با خرید یک بلیط چارتری مشاهده
                نمایید
              </p>
              <p className="text-wrap  text-[18px] leading-9">
                برج جذاب ترکیه یکی از بزرگترین و زیباترین برج های ترکیه واقع در
                استانبول می باشد که شما می توانید با خرید یک بلیط چارتری مشاهده
                نمایید برج جذاب ترکیه یکی از بزرگترین و زیباترین برج های ترکیه
                واقع در استانبول می باشد که شما می توانید با خرید یک بلیط چارتری
                مشاهده نمایید برج جذاب ترکیه یکی از بزرگترین و زیباترین برج های
                ترکیه واقع در استانبول می باشد که شما می توانید با خرید یک بلیط
                چارتری مشاهده نمایید برج جذاب ترکیه یکی از بزرگترین و زیباترین
                برج های ترکیه واقع در استانبول می باشد که شما می توانید با خرید
                یک بلیط چارتری مشاهده نمایید برج جذاب ترکیه یکی از بزرگترین و
                زیباترین برج های ترکیه واقع در استانبول می باشد که شما می توانید
                با خرید یک بلیط چارتری مشاهده نمایید برج جذاب ترکیه یکی از
                بزرگترین و زیباترین برج های ترکیه واقع در استانبول می باشد که
                شما می توانید با خرید یک بلیط چارتری مشاهده نمایید برج جذاب
                ترکیه یکی از بزرگترین و زیباترین برج های ترکیه واقع در استانبول
                می باشد که شما می توانید با خرید یک بلیط چارتری مشاهده نمایید
                برج جذاب ترکیه یکی از بزرگترین و زیباترین برج های ترکیه واقع در
                استانبول می باشد که شما می توانید با خرید یک بلیط چارتری مشاهده
                نمایید
              </p>
              <p className="text-wrap  text-[18px] leading-9">
                برج جذاب ترکیه یکی از بزرگترین و زیباترین برج های ترکیه واقع در
                استانبول می باشد که شما می توانید با خرید یک بلیط چارتری مشاهده
                نمایید برج جذاب ترکیه یکی از بزرگترین و زیباترین برج های ترکیه
                واقع در استانبول می باشد که شما می توانید با خرید یک بلیط چارتری
                مشاهده نمایید برج جذاب ترکیه یکی از بزرگترین و زیباترین برج های
                ترکیه واقع در استانبول می باشد که شما می توانید با خرید یک بلیط
                چارتری مشاهده نمایید برج جذاب ترکیه یکی از بزرگترین و زیباترین
                برج های ترکیه واقع در استانبول می باشد که شما می توانید با خرید
                یک بلیط چارتری مشاهده نمایید برج جذاب ترکیه یکی از بزرگترین و
                زیباترین برج های ترکیه واقع در استانبول می باشد که شما می توانید
                با خرید یک بلیط چارتری مشاهده نمایید برج جذاب ترکیه یکی از
                بزرگترین و زیباترین برج های ترکیه واقع در استانبول می باشد که
                شما می توانید با خرید یک بلیط چارتری مشاهده نمایید برج جذاب
                ترکیه یکی از بزرگترین و زیباترین برج های ترکیه واقع در استانبول
                می باشد که شما می توانید با خرید یک بلیط چارتری مشاهده نمایید
                برج جذاب ترکیه یکی از بزرگترین و زیباترین برج های ترکیه واقع در
                استانبول می باشد که شما می توانید با خرید یک بلیط چارتری مشاهده
                نمایید
              </p>
              <p className="text-wrap  text-[18px] leading-9">
                برج جذاب ترکیه یکی از بزرگترین و زیباترین برج های ترکیه واقع در
                استانبول می باشد که شما می توانید با خرید یک بلیط چارتری مشاهده
                نمایید برج جذاب ترکیه یکی از بزرگترین و زیباترین برج های ترکیه
                واقع در استانبول می باشد که شما می توانید با خرید یک بلیط چارتری
                مشاهده نمایید برج جذاب ترکیه یکی از بزرگترین و زیباترین برج های
                ترکیه واقع در استانبول می باشد که شما می توانید با خرید یک بلیط
                چارتری مشاهده نمایید برج جذاب ترکیه یکی از بزرگترین و زیباترین
                برج های ترکیه واقع در استانبول می باشد که شما می توانید با خرید
                یک بلیط چارتری مشاهده نمایید برج جذاب ترکیه یکی از بزرگترین و
                زیباترین برج های ترکیه واقع در استانبول می باشد که شما می توانید
                با خرید یک بلیط چارتری مشاهده نمایید برج جذاب ترکیه یکی از
                بزرگترین و زیباترین برج های ترکیه واقع در استانبول می باشد که
                شما می توانید با خرید یک بلیط چارتری مشاهده نمایید برج جذاب
                ترکیه یکی از بزرگترین و زیباترین برج های ترکیه واقع در استانبول
                می باشد که شما می توانید با خرید یک بلیط چارتری مشاهده نمایید
                برج جذاب ترکیه یکی از بزرگترین و زیباترین برج های ترکیه واقع در
                استانبول می باشد که شما می توانید با خرید یک بلیط چارتری مشاهده
                نمایید
              </p>
            </div>
          </div>
        </div>
        <div className="w flex flex-col justify-start items-center">
          <div className="flex flex-col w-[85%] justify-center items-start ">
            <h1 className="text-orange-500 text-[45px]">نگاهی به برزیل</h1>
            <span className="text-[30px] font-bold">
              جاذبه های دیدنی و جنگل های برزیل
            </span>
          </div>
          <div className="flex mt-[50px] justify-center gap-[30px] items-center w-[85%] ">
            <div className="w flex flex-col gap-[30px]">
              <img src="/public/image/peak1.png" className="w" alt="" />
              <img src="/public/image/peak2.png" className="w" alt="" />
            </div>
            <div className="w flex flex-col gap-[30px]">
              <img src="/public/image/peak3.png" className="w" alt="" />
              <img src="/public/image/peak4.png" className="w" alt="" />
            </div>
          </div>
        </div>
        <div className="w py-[100px] f">
          <div className="w-[85%] py-[50px] px-[100px] h-[300px] flex-col flex relative justify-between items-start bg-[#1450a3] rounded-se-3xl rounded-es-3xl rounded-ss-[100px] rounded-ee-[100px]">
            <h1 className="text-[25px] text-orange-500">
              نیاز به مشاوره دارید؟
            </h1>
            <p className="text-white text-wrap w-[35%]">
              تیم پشتیبانی مجرب الیماگشت همواره و در تمامی مراحل سفر برای آسودگی
              خاطر و ارایه خدمات، همراه و یاور شماست.
            </p>
            <div className="w-[50%] p-[5px] flex justify-end items-center h-[60px] rounded-xl bg-white">
              <input
                type="text"
                name=""
                id=""
                className="w h focus:outline-none  pr-[20px]"
                placeholder="لطفاً شماره موبایل خود را وارد کنید."
              />
              <div className="h w-[25%] text-[20px] bg-orange-500 rounded-xl cursor-pointer text-[#1450a3] f gap-[10px] ">
                مشاوره
                <svg
                  xmlns="http://www.w3.org/2000/svg"
                  width="20"
                  height="20"
                  viewBox="0 0 16 16"
                  fill="none"
                >
                  <path
                    d="M11.6333 15.1668C10.88 15.1668 10.0867 14.9868 9.26666 14.6402C8.46666 14.3002 7.66 13.8335 6.87333 13.2668C6.09333 12.6935 5.34 12.0535 4.62666 11.3535C3.92 10.6402 3.28 9.88683 2.71333 9.1135C2.14 8.3135 1.67999 7.5135 1.35333 6.74016C1.00666 5.9135 0.833328 5.1135 0.833328 4.36016C0.833328 3.84016 0.926662 3.34683 1.10666 2.88683C1.29333 2.4135 1.59333 1.9735 1.99999 1.5935C2.51333 1.08683 3.1 0.833496 3.72666 0.833496C3.98666 0.833496 4.25333 0.893496 4.47999 1.00016C4.73999 1.12016 4.95999 1.30016 5.11999 1.54016L6.66666 3.72016C6.80666 3.9135 6.91333 4.10016 6.98666 4.28683C7.07333 4.48683 7.12 4.68683 7.12 4.88016C7.12 5.1335 7.04666 5.38016 6.90666 5.6135C6.80666 5.7935 6.65333 5.98683 6.45999 6.18016L6.00666 6.6535C6.01333 6.6735 6.02 6.68683 6.02666 6.70016C6.10666 6.84016 6.26666 7.08016 6.57333 7.44016C6.89999 7.8135 7.20666 8.1535 7.51333 8.46683C7.90666 8.8535 8.23333 9.16016 8.54 9.4135C8.92 9.7335 9.16666 9.8935 9.31333 9.96683L9.3 10.0002L9.78666 9.52016C9.99333 9.3135 10.1933 9.16016 10.3867 9.06016C10.7533 8.8335 11.22 8.7935 11.6867 8.98683C11.86 9.06016 12.0467 9.16016 12.2467 9.30016L14.46 10.8735C14.7067 11.0402 14.8867 11.2535 14.9933 11.5068C15.0933 11.7602 15.14 11.9935 15.14 12.2268C15.14 12.5468 15.0667 12.8668 14.9267 13.1668C14.7867 13.4668 14.6133 13.7268 14.3933 13.9668C14.0133 14.3868 13.6 14.6868 13.12 14.8802C12.66 15.0668 12.16 15.1668 11.6333 15.1668ZM3.72666 1.8335C3.36 1.8335 3.01999 1.9935 2.69333 2.3135C2.38666 2.60016 2.17333 2.9135 2.03999 3.2535C1.89999 3.60016 1.83333 3.96683 1.83333 4.36016C1.83333 4.98016 1.98 5.6535 2.27333 6.34683C2.57333 7.0535 2.99333 7.78683 3.52666 8.52016C4.05999 9.2535 4.66666 9.96683 5.33333 10.6402C6 11.3002 6.71999 11.9135 7.45999 12.4535C8.17999 12.9802 8.91999 13.4068 9.65333 13.7135C10.7933 14.2002 11.86 14.3135 12.74 13.9468C13.08 13.8068 13.38 13.5935 13.6533 13.2868C13.8067 13.1202 13.9267 12.9402 14.0267 12.7268C14.1067 12.5602 14.1467 12.3868 14.1467 12.2135C14.1467 12.1068 14.1267 12.0002 14.0733 11.8802C14.0533 11.8402 14.0133 11.7668 13.8867 11.6802L11.6733 10.1068C11.54 10.0135 11.42 9.94683 11.3067 9.90016C11.16 9.84016 11.1 9.78016 10.8733 9.92016C10.74 9.98683 10.62 10.0868 10.4867 10.2202L9.98 10.7202C9.72 10.9735 9.32 11.0335 9.01333 10.9202L8.83333 10.8402C8.56 10.6935 8.24 10.4668 7.88666 10.1668C7.56666 9.8935 7.21999 9.5735 6.79999 9.16016C6.47333 8.82683 6.14666 8.4735 5.80666 8.08016C5.49333 7.7135 5.26666 7.40016 5.12666 7.14016L5.04666 6.94016C5.00666 6.78683 4.99333 6.70016 4.99333 6.60683C4.99333 6.36683 5.07999 6.1535 5.24666 5.98683L5.74666 5.46683C5.87999 5.3335 5.97999 5.20683 6.04666 5.0935C6.09999 5.00683 6.12 4.9335 6.12 4.86683C6.12 4.8135 6.1 4.7335 6.06666 4.6535C6.02 4.54683 5.94666 4.42683 5.85333 4.30016L4.30666 2.1135C4.24 2.02016 4.16 1.9535 4.06 1.90683C3.95333 1.86016 3.84 1.8335 3.72666 1.8335ZM9.3 10.0068L9.19333 10.4602L9.37333 9.9935C9.34 9.98683 9.31333 9.9935 9.3 10.0068Z"
                    fill="#414A53"
                  />
                  <path
                    d="M12.3333 6.49984C12.06 6.49984 11.8333 6.27317 11.8333 5.99984C11.8333 5.75984 11.5933 5.25984 11.1933 4.83317C10.8 4.41317 10.3667 4.1665 10 4.1665C9.72667 4.1665 9.5 3.93984 9.5 3.6665C9.5 3.39317 9.72667 3.1665 10 3.1665C10.6467 3.1665 11.3267 3.51317 11.92 4.1465C12.4733 4.73984 12.8333 5.4665 12.8333 5.99984C12.8333 6.27317 12.6067 6.49984 12.3333 6.49984Z"
                    fill="#414A53"
                  />
                  <path
                    d="M14.6667 6.50016C14.3933 6.50016 14.1667 6.2735 14.1667 6.00016C14.1667 3.70016 12.3 1.8335 10 1.8335C9.72667 1.8335 9.5 1.60683 9.5 1.3335C9.5 1.06016 9.72667 0.833496 10 0.833496C12.8467 0.833496 15.1667 3.1535 15.1667 6.00016C15.1667 6.2735 14.94 6.50016 14.6667 6.50016Z"
                    fill="#414A53"
                  />
                </svg>
              </div>
            </div>
            <img
              src="/public/image/SIGN-UP.png"
              className="w-[350px] absolute left-20 bottom-0"
              alt=""
            />
          </div>
        </div>
      </div>
    </motion.div>
  );
};

export default Landing;
