import { motion } from "framer-motion";
import TopLogo from "../Header/TopLogo";

const AboutUs = () => {
  return (
    <motion.div
      initial={{ opacity: 0 }}
      animate={{ opacity: 1 }}
      exit={{ opacity: 0 }}
      transition={{ duration: 1 }}
    >
      <div className="w h-[775px] flex justify-center items-start  bg-[url('/public/image/about-main.png')] bg-cover bg-center ">
        <TopLogo />
      </div>
      
      <div className="flex-col flex gap-[50px] justify-center items-start p-[50px]">
        <div className="text-[45px]  flex flex-col text-[#DF6951] ">
          چرا الیماگشت
          <span className="text-[25px] text-black ">
            از هر نقطه ایران همسفر الیما باشید
          </span>
        </div>
        <div className="w-[90%]">
          <p className="text-wrap  leading-8 font-light">
            برج جذاب ترکیه یکی از بزرگترین و زیباترین برج های ترکیه واقع در
            استانبول می باشد که شما می توانید با خرید یک بلیط چارتری مشاهده
            نمایید برج جذاب ترکیه یکی از بزرگترین و زیباترین برج های ترکیه واقع
            در استانبول می باشد که شما می توانید با خرید یک بلیط چارتری مشاهده
            نمایید برج جذاب ترکیه یکی از بزرگترین و زیباترین برج های ترکیه واقع
            در استانبول می باشد که شما می توانید با خرید یک بلیط چارتری مشاهده
            نمایید برج جذاب ترکیه یکی از بزرگترین و زیباترین برج های ترکیه واقع
            در استانبول می باشد که شما می توانید با خرید یک بلیط چارتری مشاهده
            نمایید برج جذاب ترکیه یکی از بزرگترین و زیباترین برج های ترکیه واقع
            در استانبول می باشد که شما می توانید با خرید یک بلیط چارتری مشاهده
            نمایید برج جذاب ترکیه یکی از بزرگترین و زیباترین برج های ترکیه واقع
            در استانبول می باشد که شما می توانید با خرید یک بلیط چارتری مشاهده
            نمایید برج جذاب ترکیه یکی از بزرگترین و زیباترین برج های ترکیه واقع
            در استانبول می باشد که شما می توانید با خرید یک بلیط چارتری مشاهده
            نمایید برج جذاب ترکیه یکی از بزرگترین و زیباترین برج های ترکیه واقع
            در استانبول می باشد که شما می توانید با خرید یک بلیط چارتری مشاهده
            نمایید
          </p>
          <p className="text-wrap  leading-8 font-light">
            برج جذاب ترکیه یکی از بزرگترین و زیباترین برج های ترکیه واقع در
            استانبول می باشد که شما می توانید با خرید یک بلیط چارتری مشاهده
            نمایید برج جذاب ترکیه یکی از بزرگترین و زیباترین برج های ترکیه واقع
            در استانبول می باشد که شما می توانید با خرید یک بلیط چارتری مشاهده
            نمایید برج جذاب ترکیه یکی از بزرگترین و زیباترین برج های ترکیه واقع
            در استانبول می باشد که شما می توانید با خرید یک بلیط چارتری مشاهده
            نمایید برج جذاب ترکیه یکی از بزرگترین و زیباترین برج های ترکیه واقع
            در استانبول می باشد که شما می توانید با خرید یک بلیط چارتری مشاهده
            نمایید برج جذاب ترکیه یکی از بزرگترین و زیباترین برج های ترکیه واقع
            در استانبول می باشد که شما می توانید با خرید یک بلیط چارتری مشاهده
            نمایید برج جذاب ترکیه یکی از بزرگترین و زیباترین برج های ترکیه واقع
            در استانبول می باشد که شما می توانید با خرید یک بلیط چارتری مشاهده
            نمایید برج جذاب ترکیه یکی از بزرگترین و زیباترین برج های ترکیه واقع
            در استانبول می باشد که شما می توانید با خرید یک بلیط چارتری مشاهده
            نمایید برج جذاب ترکیه یکی از بزرگترین و زیباترین برج های ترکیه واقع
            در استانبول می باشد که شما می توانید با خرید یک بلیط چارتری مشاهده
            نمایید
          </p>
          <p className="text-wrap  leading-8 font-light">
            برج جذاب ترکیه یکی از بزرگترین و زیباترین برج های ترکیه واقع در
            استانبول می باشد که شما می توانید با خرید یک بلیط چارتری مشاهده
            نمایید برج جذاب ترکیه یکی از بزرگترین و زیباترین برج های ترکیه واقع
            در استانبول می باشد که شما می توانید با خرید یک بلیط چارتری مشاهده
            نمایید برج جذاب ترکیه یکی از بزرگترین و زیباترین برج های ترکیه واقع
            در استانبول می باشد که شما می توانید با خرید یک بلیط چارتری مشاهده
            نمایید برج جذاب ترکیه یکی از بزرگترین و زیباترین برج های ترکیه واقع
            در استانبول می باشد که شما می توانید با خرید یک بلیط چارتری مشاهده
            نمایید برج جذاب ترکیه یکی از بزرگترین و زیباترین برج های ترکیه واقع
            در استانبول می باشد که شما می توانید با خرید یک بلیط چارتری مشاهده
            نمایید برج جذاب ترکیه یکی از بزرگترین و زیباترین برج های ترکیه واقع
            در استانبول می باشد که شما می توانید با خرید یک بلیط چارتری مشاهده
            نمایید برج جذاب ترکیه یکی از بزرگترین و زیباترین برج های ترکیه واقع
            در استانبول می باشد که شما می توانید با خرید یک بلیط چارتری مشاهده
            نمایید برج جذاب ترکیه یکی از بزرگترین و زیباترین برج های ترکیه واقع
            در استانبول می باشد که شما می توانید با خرید یک بلیط چارتری مشاهده
            نمایید
          </p>
          <p className="text-wrap  leading-8 font-light">
            برج جذاب ترکیه یکی از بزرگترین و زیباترین برج های ترکیه واقع در
            استانبول می باشد که شما می توانید با خرید یک بلیط چارتری مشاهده
            نمایید برج جذاب ترکیه یکی از بزرگترین و زیباترین برج های ترکیه واقع
            در استانبول می باشد که شما می توانید با خرید یک بلیط چارتری مشاهده
            نمایید برج جذاب ترکیه یکی از بزرگترین و زیباترین برج های ترکیه واقع
            در استانبول می باشد که شما می توانید با خرید یک بلیط چارتری مشاهده
            نمایید برج جذاب ترکیه یکی از بزرگترین و زیباترین برج های ترکیه واقع
            در استانبول می باشد که شما می توانید با خرید یک بلیط چارتری مشاهده
            نمایید برج جذاب ترکیه یکی از بزرگترین و زیباترین برج های ترکیه واقع
            در استانبول می باشد که شما می توانید با خرید یک بلیط چارتری مشاهده
            نمایید برج جذاب ترکیه یکی از بزرگترین و زیباترین برج های ترکیه واقع
            در استانبول می باشد که شما می توانید با خرید یک بلیط چارتری مشاهده
            نمایید برج جذاب ترکیه یکی از بزرگترین و زیباترین برج های ترکیه واقع
            در استانبول می باشد که شما می توانید با خرید یک بلیط چارتری مشاهده
            نمایید برج جذاب ترکیه یکی از بزرگترین و زیباترین برج های ترکیه واقع
            در استانبول می باشد که شما می توانید با خرید یک بلیط چارتری مشاهده
            نمایید
          </p>
        </div>
      </div>
      <div className="w h-[300px] f bg-[#e8f4fa]">
        <div className=" flex  items-center justify-center gap-[150px]">
          <img src="/public/image/flight-logo.png" alt="" />
          <img src="/public/image/flight-logo-2.png" alt="" />
          <img src="/public/image/flight-logo-3.png" alt="" />
          <img src="/public/image/flight-logo-4.png" alt="" />
        </div>
      </div>
      <div className="w h-auto f">
        <div className="w-[80vw] p-[100px] f gap-[50px] flex-wrap">
          <div className="w-[300px] h-[400px] rounded-2xl flex flex-col justify-start items-center p-[20px] gap-[20px]  shadow-2xl  shadow-black/40">
            <img
              src="/public/image/sheykhi.jpg"
              alt=""
              className="w-[250px] h-[250px] rounded-2xl"
            />
            <h1 className="text-[25px]">حسن شیخی</h1>
            <span>مدیر پرواز</span>
          </div>
          <div className="w-[300px] h-[400px] rounded-2xl flex flex-col justify-start items-center p-[20px] gap-[20px]  shadow-2xl  shadow-black/40">
            <img
              src="/public/image/sheykhi.jpg"
              alt=""
              className="w-[250px] h-[250px] rounded-2xl"
            />
            <h1 className="text-[25px]">حسن شیخی</h1>
            <span>مدیر پرواز</span>
          </div>
          <div className="w-[300px] h-[400px] rounded-2xl flex flex-col justify-start items-center p-[20px] gap-[20px]  shadow-2xl  shadow-black/40">
            <img
              src="/public/image/sheykhi.jpg"
              alt=""
              className="w-[250px] h-[250px] rounded-2xl"
            />
            <h1 className="text-[25px]">حسن شیخی</h1>
            <span>مدیر پرواز</span>
          </div>
          <div className="w-[300px] h-[400px] rounded-2xl flex flex-col justify-start items-center p-[20px] gap-[20px]  shadow-2xl  shadow-black/40">
            <img
              src="/public/image/sheykhi.jpg"
              alt=""
              className="w-[250px] h-[250px] rounded-2xl"
            />
            <h1 className="text-[25px]">حسن شیخی</h1>
            <span>مدیر پرواز</span>
          </div>
          <div className="w-[300px] h-[400px] rounded-2xl flex flex-col justify-start items-center p-[20px] gap-[20px]  shadow-2xl  shadow-black/40">
            <img
              src="/public/image/sheykhi.jpg"
              alt=""
              className="w-[250px] h-[250px] rounded-2xl"
            />
            <h1 className="text-[25px]">حسن شیخی</h1>
            <span>مدیر پرواز</span>
          </div>
          <div className="w-[300px] h-[400px] rounded-2xl flex flex-col justify-start items-center p-[20px] gap-[20px]  shadow-2xl  shadow-black/40">
            <img
              src="/public/image/sheykhi.jpg"
              alt=""
              className="w-[250px] h-[250px] rounded-2xl"
            />
            <h1 className="text-[25px]">حسن شیخی</h1>
            <span>مدیر پرواز</span>
          </div>
        </div>
      </div>
    </motion.div>
  );
};

export default AboutUs;
